 // фото для раздела Skills
import html5 from './images/html5.svg';
import css3 from './images/css3.svg';
import js from './images/JS.svg';
import react from './images/React.svg';
import redux from  './images/redux.png';
import node from  './images/Node.js.svg';
import express from  './images/Expressjs.png';
import mongo from  './images/Mongo.db.svg';
import typescript from './images/Typescript.svg'

export const skills = [
    {
      id: '1',
      image: html5,
      alt:"логотип html5",
      text: 'Именно он создает каркас вашего сайта или приложения, а пятая версия позволит мне создавать более SEO-оптимизированную структуру вашего продукта'
    },
    {
      id: '2',
      image: css3,
      alt:"логотип css3",
      text: 'Этот язык стилей позволяет мне создавать абсолютно любой внешний вид вашего сайта или приложения. Все ограничивается только вашей фантазией!'
    },
    {
      id: '3',
      image: js,
      alt:"логотип JavaScript",
      text: 'Этот язык программирования позволяет оживить все что угодно: слайдеры, окна, подсказки, вкладки, получение данных от сервера и многое другое'
    },
    {
      id: '4',
      image: react,
      alt:"логотип React",
      text: 'Эотот фрэймворк позволяет создавать web-приложения. Он помогает создать максимально интерактивный продукт именно под ваши цели'
    },
    {
      id: '5',
      image: redux,
      alt:"логотип Redux",
      text: 'Эта библиотека предназначенна для управления состоянием приложения. Содержит ряд инструментов, позволяющих значительно упростить передачу данных хранилища через контекст'
    },
    {
      id: '6',
      image: node,
      alt:"логотип Node.js",
      text: 'Эта платформа позволяет создавать бэкенд для вашего продукта - “мозги”, которые будут выполнять действия, которые пользователь не видит'
    },
    {
      id: '7',
      image: express,
      alt:"логотип Express",
      text: 'Этот фрэймворк помогает ускорить разработку бэкэнда вашего продукта.'
    },
    {
      id: '8',
      image: mongo,
      alt:"логотип Mongo.db",
      text: 'Это нереляционная база данных, которая будет хранить данные вашего сайта или приложения'
    },
    {
      id: '9',
      image: typescript,
      alt:"логотип TypeScript",
      text: 'Это язык програмирования расширяющий возможности JavaScript. Главная особенность языка - типизация данных. Благодаря ему можно избежать многих ошибок в коде.'
    },
  ]
